CSI API ETABS v1
Visual C++ 2022
 This example was created and tested in Microsoft Visual C++ 2022.
 Create a C++ Windows Console application.
 Locate the ETABSv1.tlb
 With the release of ETABS v22.0.0 , users will need to select the TLB file that corresponds to the bitness of their API client, e.g. 32-bit or 64-bit. To locate these files, the user should navigate to the directory where ETABS is installed. This is typically C:\Program Files\Computers and Structures\ETABS 22\
 Within this directory, the 32-bit library is found at NativeAPI\x86\ETABSv1.tlb The 64-bit library is found at NativeAPI\x64\ETABSv1.tlb
 Copy the 64-bit ETABSv1.tlb file from the installation folder to the project directory. It should be copied to the same level as your client application’s project file.
 Open the .cpp file generated by the wizard by double-clicking on it and paste in the following ready-to-run code:
#define _CRT_SECURE_NO_WARNINGS
#include <atlbase.h>
#include <atlstr.h>
#include <atlsafe.h>
#include <iostream>
#include <iomanip>
#import "ETABSv1.tlb"  no_dual_interfaces rename("GetObject", "GetObject_") rename("Yield", "Yield_") rename("GetProp", "GetProp_") rename("SetProp", "SetProp_")
bool CheckHRESULT(HRESULT hRes, const wchar_t* msg)
{
    if (hRes == S_FALSE || FAILED(hRes)) {
        MessageBox(0, msg, L"ERROR!", MB_SETFOREGROUND);
        return (false);
    }
    return (true);
}
int main(int argc, char* argv[])
{
    ::SetConsoleOutputCP(CP_UTF8);
    // set the following flag to true to attach to an existing instance of the program
// otherwise a new instance of the program will be started
    bool bAttachToInstance = false;
    // set the following flag to true to manually specify the path to ETABS.exe
    // this allows for a connection to a version of ETABS other than the latest installation
    // otherwise the latest installed version of ETABS will be launched
    bool bSpecifyPath = false;
    // if the above flag is set to true, specify the path to ETABS below
    std::wstring ProgramPath;
    int mode = 1;
    //1- start
    //2- start from path
    //3- attach
    switch (argc)
    {
    case 1: // no arguments - mode start
        bAttachToInstance = false;
        bSpecifyPath = false;
        break;
    case 2: // one argument - mode attach
        bAttachToInstance = true;
        break;
    case 3: // two argument - mode start from path
        bAttachToInstance = false;
        bSpecifyPath = true;
        char* p = argv[2];
        const size_t cSize = strlen(p) + 1;
        std::wstring wc(cSize, L'#');
        mbstowcs(&wc[0], p, cSize);
        ProgramPath = wc;
        break;
    }
    // use res to check if functions return successfully (res = 0) or fail (res = nonzero)
    HRESULT hRes = 0;
    int res = 0;
    // initialize COM
    hRes = CoInitialize(NULL);
    if (!CheckHRESULT(hRes, L"Error initializing COM subsystem!")) return (hRes);
    // ETABSObject pointer
    CComPtr<ETABSv1::cOAPI> pETABSObject;
    try {
        // create Helper
        CComPtr<ETABSv1::cHelper> pHelper;
        hRes = pHelper.CoCreateInstance(L"ETABSv1.Helper", NULL, CLSCTX_INPROC_SERVER);
        if (!CheckHRESULT(hRes, L"Cannot instantiate helper!")) return (hRes);
        if (bAttachToInstance) {
            // attach to a running instance of ETABS
            // get the active ETABS object
            pETABSObject = pHelper->GetObject_(L"CSI.ETABS.API.ETABSObject");
            hRes = ((pETABSObject) ? S_OK : S_FALSE);
            if (!CheckHRESULT(hRes, L"Cannot attach to ETABSObject!")) return (hRes);
        }
        else {
            // start a new instance of ETABS
            if (bSpecifyPath) {
                // create an instance of the ETABS object from the specified path
                pETABSObject = pHelper->CreateObject(ProgramPath.c_str());
                hRes = ((pETABSObject) ? S_OK : S_FALSE);
                if (!CheckHRESULT(hRes, L"Cannot instantiate ETABSObject!")) return (hRes);
            }
            else {
                // create an instance of the ETABS object from the latest installed ETABS
                pETABSObject = pHelper->CreateObjectProgID(L"CSI.ETABS.API.ETABSObject");
                hRes = ((pETABSObject) ? S_OK : S_FALSE);
                if (!CheckHRESULT(hRes, L"Cannot instantiate ETABSObject!")) return (hRes);
            }
            double ver = pETABSObject->GetOAPIVersionNumber();
            // start ETABS application
            res = pETABSObject->ApplicationStart();
            if (!CheckHRESULT(hRes, L"ETABSObject.ApplicationStart failed!")) return (hRes);
        }
        // initialize model
        res = pETABSObject->SapModel->InitializeNewModel(ETABSv1::eUnits_kip_in_F);
        // create steel deck template model
        res = pETABSObject->SapModel->File->NewSteelDeck(4, 12, 12, 4, 4, 24, 24);
        // save model;
        CreateDirectory(L"C:\\CSi_ETABS_API_example\\", NULL);
        res = pETABSObject->SapModel->File->Save(L"C:\\CSi_ETABS_API_example\\example.edb");
        // run model (this will create the analysis model)
        res = pETABSObject->SapModel->Analyze->RunAnalysis();
        // clear all case and combo output selections
        res = pETABSObject->SapModel->Results->Setup->DeselectAllCasesAndCombosForOutput();
        // set case and combo output selections
        res = pETABSObject->SapModel->Results->Setup->SetCaseSelectedForOutput("DEAD", VARIANT_TRUE);
        // get frame forces for all frame objects
        long NumberResults;
        CComSafeArray<BSTR> Obj(1);
        Obj[0] = ::SysAllocString(L"");
        CComSafeArray<double> ObjSta(1);
        CComSafeArray<BSTR> Elm(1);
        Elm[0] = ::SysAllocString(L"");
        CComSafeArray<double> ElmSta(1);
        CComSafeArray<BSTR> LoadCase(1);
        LoadCase[0] = ::SysAllocString(L"");
        CComSafeArray<BSTR> StepType(1);
        StepType[0] = ::SysAllocString(L"");
        CComSafeArray<double> StepNum(1);
        CComSafeArray<double> P(1);
        CComSafeArray<double> V2(1);
        CComSafeArray<double> V3(1);
        CComSafeArray<double> T(1);
        CComSafeArray<double> M2(1);
        CComSafeArray<double> M3(1);
        LPSAFEARRAY pObj = Obj.Detach();
        LPSAFEARRAY pObjSta = ObjSta.Detach();
        LPSAFEARRAY pElm = Elm.Detach();
        LPSAFEARRAY pElmSta = ElmSta.Detach();
        LPSAFEARRAY pLoadCase = LoadCase.Detach();
        LPSAFEARRAY pStepType = StepType.Detach();
        LPSAFEARRAY pStepNum = StepNum.Detach();
        LPSAFEARRAY pP = P.Detach();
        LPSAFEARRAY pV2 = V2.Detach();
        LPSAFEARRAY pV3 = V3.Detach();
        LPSAFEARRAY pT = T.Detach();
        LPSAFEARRAY pM2 = M2.Detach();
        LPSAFEARRAY pM3 = M3.Detach();
        res = pETABSObject->SapModel->Results->FrameForce("All", ETABSv1::eItemTypeElm_GroupElm, &NumberResults, &pObj, &pObjSta, &pElm, &pElmSta, &pLoadCase, &pStepType, &pStepNum, &pP, &pV2, &pV3, &pT, &pM2, &pM3);
        Obj.Attach(pObj);
        ObjSta.Attach(pObjSta);
        Elm.Attach(pElm);
        ElmSta.Attach(pElmSta);
        LoadCase.Attach(pLoadCase);
        StepType.Attach(pStepType);
        StepNum.Attach(pStepNum);
        P.Attach(pP);
        V2.Attach(pV2);
        V3.Attach(pV3);
        T.Attach(pT);
        M2.Attach(pM2);
        M3.Attach(pM3);
        // close ETABS
        CComVariant vFalse(false);
        res = pETABSObject->ApplicationExit(false);
        // uninitialize COM
        CoUninitialize();
        // we're done!
        return (res);
    }
    catch (_com_error& ex) {
        CheckHRESULT(ex.Error(), ex.ErrorMessage());
        // close ETABS
        CComVariant vRes = pETABSObject->ApplicationExit(false);
        // uninitialize COM
        CoUninitialize();
        return (-1);
    }
    return EXIT_SUCCESS;
}